const SCENES = {
	START: 'START',
	MENU: 'MENU',
	MILEAGE: 'MILEAGE',
};

const STEPS = {
	FIRST: 1,
	SECOND: 2,
	THIRD: 3,
	FOURTH: 4,
	FIFTH: 5,
};

const TEXT = {
	REG_TEXT: {
		ua: 'Мене звати Automobot 😎\n\nМоя мета - допомогти тобі вчасно обслужити свою машину. Все що тобі треба зробити - додати своє авто. Розпочнемо? 🔥',
		ru: 'Меня зовут Automobot 😎\n\nМоя цель — помочь тебе вовремя обслужить свою машину. Всё что тебе нужно сделать — добавить своё авто. Погнали? 🔥',
	},
	REG_BTN: {
		ua: 'Зареєструватися ✅',
		ru: 'Зарегистрироваться ✅',
	},
	START_RULES: {
		ua: 'Щоб розпочати користування ботом, звернiться в автосервіс, на якому ви обслуговуєте своє авто!\n\nУ разі, якщо у них немає Automobot - розкажіть про нього!\n\nC повагою, команда Automobot.net',
		ru: 'Чтобы начать пользоваться ботом, обратитесь в автосервис, на котором вы обслуживаете свой автомобиль!\n\nВ случае, если у них нет Automobot - расскажите о нем!\n\nC уважением, команда Automobot.net',
	},
	MAIN_MENU: {
		ua: 'Головне меню',
		ru: 'Главное меню',
	},
	CARS_BTN: {
		ua: '⭐️ Мої авто',
		ru: '⭐️ Мои авто',
	},
	PRESS_SHARE_BNT: {
		ua: 'Поділіться своїм номером, за допомогою кнопки нижче',
		ru: 'Пожалуйста, нажмите на кнопку номера',
	},
	COMPLETE_REG: {
		ua: 'Для завершення реєстрації, заповнiть форму вашого авто ⬇️',
		ru: 'Для завершения регистрации, заполните форму о вашем авто ⬇️',
	},
	COMPLETE_REG_BTN: {
		ua: 'Зареєструвати авто 🌐',
		ru: 'Зарегистрировать авто 🌐',
	},
	ERROR_TEXT: {
		ua: 'Упс, сталася непередбачена помилка. Будь ласка, повторiть процедуру з початку 😅',
		ru: 'Упс, случилась непредвиденная ошибка в момент обработки запроса. Пожалуйста, повторите процедуру с начала 😅',
	},
	REENTER_GREETING: {
		ua: 'З поверненням, ',
		ru: 'Рад видеть вас снова, ',
	},
	NO_CARS: {
		ua: 'Список ваших авто порожній, будь ласка, пройдіть реєстрацію',
		ru: 'Список ваших авто пуст, пожалуйста, пройдите регистрацию',
	},
	UNKNOWN_COMMAND: {
		ua: 'Незрозумiла команда',
		ru: 'Не понял команду',
	},
	CAR_REG_DATE: {
		ua: 'Зареєстрована:',
		ru: 'Зарегистрирована:',
	},
	CAR_VIN: {
		ua: 'VIN:',
		ru: 'VIN:',
	},
	CAR_MILEAGE: {
		ua: 'Пробіг:',
		ru: 'Пробег:',
	},
	THANKS: {
		ua: 'Інформація вже в твоїх майстрів! Нехай щастить!',
		ru: 'Спасибо за информацию!',
	},
	LOW_MILAGE: {
		ua: 'Будь ласка, введіть коректну інформацію про пробіг вашого авто 👇',
		ru: 'Пожалуйста, введите корректную информацию о пробеге вашего авто 👇',
	},
	TEXT_INSTEAD_MILEAGE: {
		ua: 'Будь ласка, введіть пробіг авто, тільки цифри, приміром 14800 👇',
		ru: 'Пожалуйста, введите пробег авто, только цифры, к примеру 14800 👇',
	},
};

module.exports = { SCENES, STEPS, TEXT };
